           IDENTIFICATION DIVISION.
           PROGRAM-ID. OPERATION_NUMBERS.

           DATA DIVISION.

           WORKING-STORAGE SECTION.

           01 NUM1 PIC S9(7)V99 VALUE ZERO.

           01 NUM2 PIC S9(7)V99 VALUE ZERO.

           01 TOTALFORSUM PIC S9(7)V99 VALUE ZERO.

           01 TOTALFORDIFFERENCE PIC S9(7)V99 VALUE ZERO.

           01 TOTALFORMULTIPLICATION PIC S9(7)V99 VALUE ZERO.

           PROCEDURE DIVISION.
           DISPLAY "NEVER SEEN SOMETHING LIKE THIS XD, PLEASE USE (.) ".

           DISPLAY "PLEASE... ENTER YOUR FIRST NUMBER : ".
           ACCEPT NUM1.

           DISPLAY "ANOTHER... FOR NUM2 Xd : ".
           ACCEPT NUM2.

           COMPUTE TOTALFORSUM = NUM1 + NUM2.

           IF NUM1 IS NEGATIVE
               COMPUTE TOTALFORDIFFERENCE = NUM1 - NUM2
           ELSE
               COMPUTE TOTALFORDIFFERENCE = NUM1 + NUM2
           END-IF


           COMPUTE TOTALFORMULTIPLICATION = NUM1 * NUM2.

           DISPLAY "THE SUM IS -->  " TOTALFORSUM .
           DISPLAY " ".

           DISPLAY "THE DIFFERENCE IS -->  " TOTALFORDIFFERENCE .
           DISPLAY " ".

           DISPLAY "THE PRODUCT IS -->  " TOTALFORMULTIPLICATION .
           DISPLAY " ".

           STOP RUN.
